PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc43xx/chip/lpc4310203050_pinconfig.h
/****************************************************************************************************
 * arch/arm/src/lpc43xx/chip/lpc4310203050_pinconfig.h
 *
 *   Copyright (C) 2012 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************************************/

#ifndef __ARCH_ARM_SRC_LPC43XX_CHIP_LPC4310203050_PINCONF_H
#define __ARCH_ARM_SRC_LPC43XX_CHIP_LPC4310203050_PINCONF_H

/****************************************************************************************************
 * Included Files
 ****************************************************************************************************/

#include <nuttx/config.h>

/****************************************************************************************************
 * Pre-processor Definitions
 ****************************************************************************************************/
/* NOTES:
 *
 * 1. These settings were taken from the LPC43_10_20_30_50 data sheet and may not be applicable to
 *    any other family members.
 *
 * 2. Settings taken from the data sheet include only function, pin set, and pin number.  Additional
 *    settings must be verfied before using these pin configurations (like pull-ups, open-drain,
 *    drive strength, etc.).
 *
 * 3. Alternative pin selections are provided with a numeric suffix like _1, _2, etc. Drivers,
 *    however, will use the pin selection without the numeric suffix.  Additional definitions are
 *    required in the board.h file to select between the alternative pins.  For example, if CAN1_RD
 *    connects via Pins1[18], then the following definition should appear inthe board.h header file
 *    for that board:
 *
 *    #define PINCONF_CAN1_RD PINCONF_CAN1_RD_1
 *
 *    The driver will then automatically configre Pins1[18] as the CAN1 RD pin.
 */

#define PINCONF_ADC0p0           (PINCONF_ANALOG|PINCONF_FUNC0|PINCONF_PINS4|PINCONF_PIN_3)
#define PINCONF_ADC0p1           (PINCONF_ANALOG|PINCONF_FUNC0|PINCONF_PINS4|PINCONF_PIN_1)
#define PINCONF_ADC0p2           (PINCONF_ANALOG|PINCONF_FUNC4|PINCONF_PINSF|PINCONF_PIN_8)
#define PINCONF_ADC0p3           (PINCONF_ANALOG|PINCONF_FUNC0|PINCONF_PINS7|PINCONF_PIN_5)
#define PINCONF_ADC0p4           (PINCONF_ANALOG|PINCONF_FUNC0|PINCONF_PINS7|PINCONF_PIN_4)
#define PINCONF_ADC0p5           (PINCONF_ANALOG|PINCONF_FUNC4|PINCONF_PINSF|PINCONF_PIN_10)
#define PINCONF_ADC0p6           (PINCONF_ANALOG|PINCONF_FUNC0|PINCONF_PINSB|PINCONF_PIN_6)

#define PINCONF_ADC1p0           (PINCONF_ANALOG|PINCONF_FUNC4|PINCONF_PINSC|PINCONF_PIN_3)
#define PINCONF_ADC1p1           (PINCONF_ANALOG|PINCONF_FUNC0|PINCONF_PINSC|PINCONF_PIN_0)
#define PINCONF_ADC1p2           (PINCONF_ANALOG|PINCONF_FUNC4|PINCONF_PINSF|PINCONF_PIN_9)
#define PINCONF_ADC1p3           (PINCONF_ANALOG|PINCONF_FUNC4|PINCONF_PINSF|PINCONF_PIN_6)
#define PINCONF_ADC1p4           (PINCONF_ANALOG|PINCONF_FUNC4|PINCONF_PINSF|PINCONF_PIN_5)
#define PINCONF_ADC1p5           (PINCONF_ANALOG|PINCONF_FUNC4|PINCONF_PINSF|PINCONF_PIN_11)
#define PINCONF_ADC1p6           (PINCONF_ANALOG|PINCONF_FUNC0|PINCONF_PINS7|PINCONF_PIN_7)
#define PINCONF_ADC1p7           (PINCONF_ANALOG|PINCONF_FUNC4|PINCONF_PINSF|PINCONF_PIN_7)

#define PINCONF_ADCTRIG0         (PINCONF_DIGITAL|PINCONF_FUNC0|PINCONF_PINSE|PINCONF_PIN_2)
#define PINCONF_ADCTRIG1_1       (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINSE|PINCONF_PIN_3)
#define PINCONF_ADCTRIG1_2       (PINCONF_DIGITAL|PINCONF_FUNC3|PINCONF_PINS2|PINCONF_PIN_5)

#define PINCONF_CAN0_RD_1        (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSE|PINCONF_PIN_2)
#define PINCONF_CAN0_RD_2        (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINS3|PINCONF_PIN_1)
#define PINCONF_CAN0_TD_1        (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSE|PINCONF_PIN_3)
#define PINCONF_CAN0_TD_2        (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINS3|PINCONF_PIN_2)

#define PINCONF_CAN1_RD_1        (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS1|PINCONF_PIN_18)
#define PINCONF_CAN1_RD_2        (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINSE|PINCONF_PIN_1)
#define PINCONF_CAN1_RD_3        (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINS4|PINCONF_PIN_9)
#define PINCONF_CAN1_TD_1        (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS1|PINCONF_PIN_17)
#define PINCONF_CAN1_TD_2        (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINSE|PINCONF_PIN_0)
#define PINCONF_CAN1_TD_3        (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINS4|PINCONF_PIN_8)

