PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc43xx/chip/lpc4310203050_pinconfig.h
#define PINCONF_SPIFI_CS         (PINCONF_DIGITAL|PINCONF_FUNC3|PINCONF_PINS3|PINCONF_PIN_8)
#define PINCONF_SPIFI_MISO       (PINCONF_DIGITAL|PINCONF_FUNC3|PINCONF_PINS3|PINCONF_PIN_6)
#define PINCONF_SPIFI_MOSI       (PINCONF_DIGITAL|PINCONF_FUNC3|PINCONF_PINS3|PINCONF_PIN_7)
#define PINCONF_SPIFI_SCK        (PINCONF_DIGITAL|PINCONF_FUNC3|PINCONF_PINS3|PINCONF_PIN_3)
#define PINCONF_SPIFI_SIO2       (PINCONF_DIGITAL|PINCONF_FUNC3|PINCONF_PINS3|PINCONF_PIN_5)
#define PINCONF_SPIFI_SIO3       (PINCONF_DIGITAL|PINCONF_FUNC3|PINCONF_PINS3|PINCONF_PIN_4)

#define PINCONF_SPI_MISO         (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS3|PINCONF_PIN_6)
#define PINCONF_SPI_MOSI         (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS3|PINCONF_PIN_7)
#define PINCONF_SPI_SCK          (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS3|PINCONF_PIN_3)
#define PINCONF_SPI_SSEL         (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS3|PINCONF_PIN_8)

#define PINCONF_SSP0_MISO_1      (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINS3|PINCONF_PIN_7)
#define PINCONF_SSP0_MISO_2      (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINSF|PINCONF_PIN_2)
#define PINCONF_SSP0_MISO_3      (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS1|PINCONF_PIN_1)
#define PINCONF_SSP0_MISO_4      (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS3|PINCONF_PIN_6)
#define PINCONF_SSP0_MISO_5      (PINCONF_DIGITAL|PINCONF_FUNC7|PINCONF_PINS9|PINCONF_PIN_1)
#define PINCONF_SSP0_MOSI_1      (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINS3|PINCONF_PIN_8)
#define PINCONF_SSP0_MOSI_2      (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINSF|PINCONF_PIN_3)
#define PINCONF_SSP0_MOSI_3      (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS1|PINCONF_PIN_2)
#define PINCONF_SSP0_MOSI_4      (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS3|PINCONF_PIN_7)
#define PINCONF_SSP0_MOSI_5      (PINCONF_DIGITAL|PINCONF_FUNC7|PINCONF_PINS9|PINCONF_PIN_2)
#define PINCONF_SSP0_SCK_1       (PINCONF_DIGITAL|PINCONF_FUNC0|PINCONF_PINSF|PINCONF_PIN_0)
#define PINCONF_SSP0_SCK_2       (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINS3|PINCONF_PIN_3)
#define PINCONF_SSP0_SCK_3       (PINCONF_DIGITAL|PINCONF_FUNC4|PINCONF_PINS3|PINCONF_PIN_0)
#define PINCONF_SSP0_SSEL_1      (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINS3|PINCONF_PIN_6)
#define PINCONF_SSP0_SSEL_2      (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINSF|PINCONF_PIN_1)
#define PINCONF_SSP0_SSEL_3      (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS1|PINCONF_PIN_0)
#define PINCONF_SSP0_SSEL_4      (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS3|PINCONF_PIN_8)
#define PINCONF_SSP0_SSEL_5      (PINCONF_DIGITAL|PINCONF_FUNC7|PINCONF_PINS9|PINCONF_PIN_0)

#define PINCONF_SSP1_MISO_1      (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS0|PINCONF_PIN_0)
#define PINCONF_SSP1_MISO_2      (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINSF|PINCONF_PIN_6)
#define PINCONF_SSP1_MISO_3      (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS1|PINCONF_PIN_3)
#define PINCONF_SSP1_MOSI_1      (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS0|PINCONF_PIN_1)
#define PINCONF_SSP1_MOSI_2      (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINSF|PINCONF_PIN_7)
#define PINCONF_SSP1_MOSI_3      (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS1|PINCONF_PIN_4)
#define PINCONF_SSP1_SCK_1       (PINCONF_DIGITAL|PINCONF_FUNC0|PINCONF_PINSF|PINCONF_PIN_4)
#define PINCONF_SSP1_SCK_2       (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS1|PINCONF_PIN_19)
#define PINCONF_SSP1_SSEL_1      (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS1|PINCONF_PIN_20)
#define PINCONF_SSP1_SSEL_2      (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINSF|PINCONF_PIN_5)
#define PINCONF_SSP1_SSEL_3      (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS1|PINCONF_PIN_5)

#define PINCONF_T0_CAP0_1        (PINCONF_DIGITAL|PINCONF_FUNC4|PINCONF_PINS1|PINCONF_PIN_13)
#define PINCONF_T0_CAP0_2        (PINCONF_DIGITAL|PINCONF_FUNC7|PINCONF_PINS8|PINCONF_PIN_4)
#define PINCONF_T0_CAP1_1        (PINCONF_DIGITAL|PINCONF_FUNC4|PINCONF_PINS1|PINCONF_PIN_12)
#define PINCONF_T0_CAP1_2        (PINCONF_DIGITAL|PINCONF_FUNC7|PINCONF_PINS8|PINCONF_PIN_5)
#define PINCONF_T0_CAP2_1        (PINCONF_DIGITAL|PINCONF_FUNC4|PINCONF_PINS1|PINCONF_PIN_20)
#define PINCONF_T0_CAP2_2        (PINCONF_DIGITAL|PINCONF_FUNC7|PINCONF_PINS8|PINCONF_PIN_6)
#define PINCONF_T0_CAP3_1        (PINCONF_DIGITAL|PINCONF_FUNC4|PINCONF_PINS1|PINCONF_PIN_17)
#define PINCONF_T0_CAP3_2        (PINCONF_DIGITAL|PINCONF_FUNC7|PINCONF_PINS8|PINCONF_PIN_7)
#define PINCONF_T0_MAT0_1        (PINCONF_DIGITAL|PINCONF_FUNC4|PINCONF_PINS1|PINCONF_PIN_16)
#define PINCONF_T0_MAT0_2        (PINCONF_DIGITAL|PINCONF_FUNC7|PINCONF_PINS8|PINCONF_PIN_0)
#define PINCONF_T0_MAT1_1        (PINCONF_DIGITAL|PINCONF_FUNC4|PINCONF_PINS1|PINCONF_PIN_15)
#define PINCONF_T0_MAT1_2        (PINCONF_DIGITAL|PINCONF_FUNC7|PINCONF_PINS8|PINCONF_PIN_1)
#define PINCONF_T0_MAT2_1        (PINCONF_DIGITAL|PINCONF_FUNC4|PINCONF_PINS1|PINCONF_PIN_14)
#define PINCONF_T0_MAT2_2        (PINCONF_DIGITAL|PINCONF_FUNC7|PINCONF_PINS8|PINCONF_PIN_2)
#define PINCONF_T0_MAT3_1        (PINCONF_DIGITAL|PINCONF_FUNC4|PINCONF_PINS1|PINCONF_PIN_18)
#define PINCONF_T0_MAT3_2        (PINCONF_DIGITAL|PINCONF_FUNC7|PINCONF_PINS8|PINCONF_PIN_3)

#define PINCONF_T1_CAP0          (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS5|PINCONF_PIN_0)
#define PINCONF_T1_CAP1          (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS5|PINCONF_PIN_1)
#define PINCONF_T1_CAP2          (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS5|PINCONF_PIN_2)
#define PINCONF_T1_CAP3          (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS5|PINCONF_PIN_3)
#define PINCONF_T1_MAT0          (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS5|PINCONF_PIN_4)
#define PINCONF_T1_MAT1          (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS5|PINCONF_PIN_5)
#define PINCONF_T1_MAT2          (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS5|PINCONF_PIN_6)
#define PINCONF_T1_MAT3          (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS5|PINCONF_PIN_7)

#define PINCONF_T2_CAP0          (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS6|PINCONF_PIN_1)
#define PINCONF_T2_CAP1          (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS6|PINCONF_PIN_2)
#define PINCONF_T2_CAP2          (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS6|PINCONF_PIN_3)
#define PINCONF_T2_CAP3          (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS6|PINCONF_PIN_6)
#define PINCONF_T2_MAT0          (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS6|PINCONF_PIN_7)
#define PINCONF_T2_MAT1          (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS6|PINCONF_PIN_8)
#define PINCONF_T2_MAT2          (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS6|PINCONF_PIN_9)
#define PINCONF_T2_MAT3          (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS6|PINCONF_PIN_11)

