PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc43xx/chip/lpc4310203050_pinconfig.h
#define PINCONF_T3_CAP0_1        (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINS2|PINCONF_PIN_0)
#define PINCONF_T3_CAP0_2        (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINSC|PINCONF_PIN_1)
#define PINCONF_T3_CAP1_1        (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINS2|PINCONF_PIN_1)
#define PINCONF_T3_CAP1_2        (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINSC|PINCONF_PIN_4)
#define PINCONF_T3_CAP2_1        (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINS2|PINCONF_PIN_2)
#define PINCONF_T3_CAP2_2        (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINSC|PINCONF_PIN_5)
#define PINCONF_T3_CAP3_1        (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINS2|PINCONF_PIN_6)
#define PINCONF_T3_CAP3_2        (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINSC|PINCONF_PIN_6)
#define PINCONF_T3_MAT0_1        (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINS2|PINCONF_PIN_3)
#define PINCONF_T3_MAT0_2        (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINSC|PINCONF_PIN_7)
#define PINCONF_T3_MAT1_1        (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINS2|PINCONF_PIN_4)
#define PINCONF_T3_MAT1_2        (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINSC|PINCONF_PIN_8)
#define PINCONF_T3_MAT2_1        (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINS2|PINCONF_PIN_5)
#define PINCONF_T3_MAT2_2        (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINSC|PINCONF_PIN_9)
#define PINCONF_T3_MAT3_1        (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINS2|PINCONF_PIN_7)
#define PINCONF_T3_MAT3_2        (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINSC|PINCONF_PIN_10)

#define PINCONF_TRACECLK         (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINSF|PINCONF_PIN_4)
#define PINCONF_TRACEDATA0_1     (PINCONF_DIGITAL|PINCONF_FUNC3|PINCONF_PINSF|PINCONF_PIN_5)
#define PINCONF_TRACEDATA0_2     (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS7|PINCONF_PIN_4)
#define PINCONF_TRACEDATA1_1     (PINCONF_DIGITAL|PINCONF_FUNC3|PINCONF_PINSF|PINCONF_PIN_6)
#define PINCONF_TRACEDATA1_2     (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS7|PINCONF_PIN_5)
#define PINCONF_TRACEDATA2_1     (PINCONF_DIGITAL|PINCONF_FUNC3|PINCONF_PINSF|PINCONF_PIN_7)
#define PINCONF_TRACEDATA2_2     (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS7|PINCONF_PIN_6)
#define PINCONF_TRACEDATA3_1     (PINCONF_DIGITAL|PINCONF_FUNC3|PINCONF_PINSF|PINCONF_PIN_8)
#define PINCONF_TRACEDATA3_2     (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINS7|PINCONF_PIN_7)

#define PINCONF_U0_DIR_1         (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS2|PINCONF_PIN_6)
#define PINCONF_U0_DIR_2         (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSF|PINCONF_PIN_9)
#define PINCONF_U0_DIR_3         (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINS6|PINCONF_PIN_2)
#define PINCONF_U0_RXD_1         (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS2|PINCONF_PIN_1)
#define PINCONF_U0_RXD_2         (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSF|PINCONF_PIN_11)
#define PINCONF_U0_RXD_3         (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINS6|PINCONF_PIN_5)
#define PINCONF_U0_RXD_4         (PINCONF_DIGITAL|PINCONF_FUNC7|PINCONF_PINS9|PINCONF_PIN_6)
#define PINCONF_U0_TXD_1         (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS2|PINCONF_PIN_0)
#define PINCONF_U0_TXD_2         (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSF|PINCONF_PIN_10)
#define PINCONF_U0_TXD_3         (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINS6|PINCONF_PIN_4)
#define PINCONF_U0_TXD_4         (PINCONF_DIGITAL|PINCONF_FUNC7|PINCONF_PINS9|PINCONF_PIN_5)
#define PINCONF_U0_UCLK_1        (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS2|PINCONF_PIN_2)
#define PINCONF_U0_UCLK_2        (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSF|PINCONF_PIN_8)
#define PINCONF_U0_UCLK_3        (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINS6|PINCONF_PIN_1)

#define PINCONF_U1_CTS_1         (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS1|PINCONF_PIN_11)
#define PINCONF_U1_CTS_2         (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINSC|PINCONF_PIN_2)
#define PINCONF_U1_CTS_3         (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINSE|PINCONF_PIN_7)
#define PINCONF_U1_CTS_4         (PINCONF_DIGITAL|PINCONF_FUNC4|PINCONF_PINS5|PINCONF_PIN_4)
#define PINCONF_U1_DCD_1         (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS1|PINCONF_PIN_12)
#define PINCONF_U1_DCD_2         (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINSC|PINCONF_PIN_11)
#define PINCONF_U1_DCD_3         (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINSE|PINCONF_PIN_9)
#define PINCONF_U1_DCD_4         (PINCONF_DIGITAL|PINCONF_FUNC4|PINCONF_PINS5|PINCONF_PIN_5)
#define PINCONF_U1_DSR_1         (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS1|PINCONF_PIN_7)
#define PINCONF_U1_DSR_2         (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINSC|PINCONF_PIN_10)
#define PINCONF_U1_DSR_3         (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINSE|PINCONF_PIN_8)
#define PINCONF_U1_DSR_4         (PINCONF_DIGITAL|PINCONF_FUNC4|PINCONF_PINS5|PINCONF_PIN_0)
#define PINCONF_U1_DTR_1         (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS1|PINCONF_PIN_8)
#define PINCONF_U1_DTR_2         (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINSC|PINCONF_PIN_12)
#define PINCONF_U1_DTR_3         (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINSE|PINCONF_PIN_10)
#define PINCONF_U1_DTR_4         (PINCONF_DIGITAL|PINCONF_FUNC4|PINCONF_PINS5|PINCONF_PIN_1)
#define PINCONF_U1_RI_1          (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS1|PINCONF_PIN_10)
#define PINCONF_U1_RI_2          (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINSC|PINCONF_PIN_1)
#define PINCONF_U1_RI_3          (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINSE|PINCONF_PIN_6)
#define PINCONF_U1_RI_4          (PINCONF_DIGITAL|PINCONF_FUNC4|PINCONF_PINS5|PINCONF_PIN_3)
#define PINCONF_U1_RTS_1         (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS1|PINCONF_PIN_9)
#define PINCONF_U1_RTS_2         (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINSC|PINCONF_PIN_3)
#define PINCONF_U1_RTS_3         (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINSE|PINCONF_PIN_5)
#define PINCONF_U1_RTS_4         (PINCONF_DIGITAL|PINCONF_FUNC4|PINCONF_PINS5|PINCONF_PIN_2)
#define PINCONF_U1_RXD_1         (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS1|PINCONF_PIN_14)
#define PINCONF_U1_RXD_2         (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINSC|PINCONF_PIN_14)
#define PINCONF_U1_RXD_3         (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINSE|PINCONF_PIN_12)
#define PINCONF_U1_RXD_4         (PINCONF_DIGITAL|PINCONF_FUNC4|PINCONF_PINS3|PINCONF_PIN_5)
#define PINCONF_U1_RXD_5         (PINCONF_DIGITAL|PINCONF_FUNC4|PINCONF_PINS5|PINCONF_PIN_7)
#define PINCONF_U1_TXD_1         (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS1|PINCONF_PIN_13)
#define PINCONF_U1_TXD_2         (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINSC|PINCONF_PIN_13)
#define PINCONF_U1_TXD_3         (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINSE|PINCONF_PIN_11)
#define PINCONF_U1_TXD_4         (PINCONF_DIGITAL|PINCONF_FUNC4|PINCONF_PINS3|PINCONF_PIN_4)
#define PINCONF_U1_TXD_5         (PINCONF_DIGITAL|PINCONF_FUNC4|PINCONF_PINS5|PINCONF_PIN_6)

