PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc43xx/chip/lpc4310203050_pinconfig.h
#define PINCONF_U2_DIR_1         (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS1|PINCONF_PIN_18)
#define PINCONF_U2_DIR_2         (PINCONF_DIGITAL|PINCONF_FUNC7|PINCONF_PINS2|PINCONF_PIN_13)
#define PINCONF_U2_RXD_1         (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS1|PINCONF_PIN_16)
#define PINCONF_U2_RXD_2         (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINS2|PINCONF_PIN_11)
#define PINCONF_U2_RXD_3         (PINCONF_DIGITAL|PINCONF_FUNC3|PINCONF_PINSA|PINCONF_PIN_2)
#define PINCONF_U2_RXD_4         (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINS7|PINCONF_PIN_2)
#define PINCONF_U2_TXD_1         (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS1|PINCONF_PIN_15)
#define PINCONF_U2_TXD_2         (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINS2|PINCONF_PIN_10)
#define PINCONF_U2_TXD_3         (PINCONF_DIGITAL|PINCONF_FUNC3|PINCONF_PINSA|PINCONF_PIN_1)
#define PINCONF_U2_TXD_4         (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINS7|PINCONF_PIN_1)
#define PINCONF_U2_UCLK_1        (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS1|PINCONF_PIN_17)
#define PINCONF_U2_UCLK_2        (PINCONF_DIGITAL|PINCONF_FUNC7|PINCONF_PINS2|PINCONF_PIN_12)

#define PINCONF_U3_BAUD_1        (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSF|PINCONF_PIN_7)
#define PINCONF_U3_BAUD_2        (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINS2|PINCONF_PIN_9)
#define PINCONF_U3_BAUD_3        (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINS4|PINCONF_PIN_3)
#define PINCONF_U3_DIR_1         (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSF|PINCONF_PIN_6)
#define PINCONF_U3_DIR_2         (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINS2|PINCONF_PIN_8)
#define PINCONF_U3_DIR_3         (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINS4|PINCONF_PIN_4)
#define PINCONF_U3_RXD_1         (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSF|PINCONF_PIN_3)
#define PINCONF_U3_RXD_2         (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINS2|PINCONF_PIN_4)
#define PINCONF_U3_RXD_3         (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINS4|PINCONF_PIN_2)
#define PINCONF_U3_RXD_4         (PINCONF_DIGITAL|PINCONF_FUNC7|PINCONF_PINS9|PINCONF_PIN_4)
#define PINCONF_U3_TXD_1         (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSF|PINCONF_PIN_2)
#define PINCONF_U3_TXD_2         (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINS2|PINCONF_PIN_3)
#define PINCONF_U3_TXD_3         (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINS4|PINCONF_PIN_1)
#define PINCONF_U3_TXD_4         (PINCONF_DIGITAL|PINCONF_FUNC7|PINCONF_PINS9|PINCONF_PIN_3)
#define PINCONF_U3_UCLK_1        (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSF|PINCONF_PIN_5)
#define PINCONF_U3_UCLK_2        (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINS2|PINCONF_PIN_7)
#define PINCONF_U3_UCLK_3        (PINCONF_DIGITAL|PINCONF_FUNC6|PINCONF_PINS4|PINCONF_PIN_0)

#define PINCONF_USB0_IND0_1      (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS8|PINCONF_PIN_2)
#define PINCONF_USB0_IND0_2      (PINCONF_DIGITAL|PINCONF_FUNC3|PINCONF_PINS2|PINCONF_PIN_6)
#define PINCONF_USB0_IND0_3      (PINCONF_DIGITAL|PINCONF_FUNC3|PINCONF_PINS6|PINCONF_PIN_8)
#define PINCONF_USB0_IND0_4      (PINCONF_DIGITAL|PINCONF_FUNC4|PINCONF_PINS1|PINCONF_PIN_4)
#define PINCONF_USB0_IND0_5      (PINCONF_DIGITAL|PINCONF_FUNC7|PINCONF_PINS2|PINCONF_PIN_5)
#define PINCONF_USB0_IND1_1      (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS8|PINCONF_PIN_1)
#define PINCONF_USB0_IND1_2      (PINCONF_DIGITAL|PINCONF_FUNC3|PINCONF_PINS2|PINCONF_PIN_2)
#define PINCONF_USB0_IND1_3      (PINCONF_DIGITAL|PINCONF_FUNC3|PINCONF_PINS6|PINCONF_PIN_7)
#define PINCONF_USB0_IND1_4      (PINCONF_DIGITAL|PINCONF_FUNC4|PINCONF_PINS1|PINCONF_PIN_3)
#define PINCONF_USB0_PPWR_1      (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS6|PINCONF_PIN_3)
#define PINCONF_USB0_PPWR_2      (PINCONF_DIGITAL|PINCONF_FUNC3|PINCONF_PINS2|PINCONF_PIN_0)
#define PINCONF_USB0_PPWR_3      (PINCONF_DIGITAL|PINCONF_FUNC4|PINCONF_PINS1|PINCONF_PIN_7)
#define PINCONF_USB0_PPWR_4      (PINCONF_DIGITAL|PINCONF_FUNC7|PINCONF_PINS2|PINCONF_PIN_3)
#define PINCONF_USB0_PWR_FAULT_1 (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS8|PINCONF_PIN_0)
#define PINCONF_USB0_PWR_FAULT_2 (PINCONF_DIGITAL|PINCONF_FUNC3|PINCONF_PINS2|PINCONF_PIN_1)
#define PINCONF_USB0_PWR_FAULT_3 (PINCONF_DIGITAL|PINCONF_FUNC3|PINCONF_PINS6|PINCONF_PIN_6)
#define PINCONF_USB0_PWR_FAULT_4 (PINCONF_DIGITAL|PINCONF_FUNC4|PINCONF_PINS1|PINCONF_PIN_5)
#define PINCONF_USB0_PWR_FAULT_5 (PINCONF_DIGITAL|PINCONF_FUNC7|PINCONF_PINS2|PINCONF_PIN_4)

#define PINCONF_USB1_IND0_1      (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINS9|PINCONF_PIN_4)
#define PINCONF_USB1_IND0_2      (PINCONF_DIGITAL|PINCONF_FUNC3|PINCONF_PINS3|PINCONF_PIN_2)
#define PINCONF_USB1_IND1_1      (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINS9|PINCONF_PIN_3)
#define PINCONF_USB1_IND1_2      (PINCONF_DIGITAL|PINCONF_FUNC3|PINCONF_PINS3|PINCONF_PIN_1)
#define PINCONF_USB1_PPWR        (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINS9|PINCONF_PIN_5)
#define PINCONF_USB1_PWR_FAULT   (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINS9|PINCONF_PIN_6)
#define PINCONF_USB1_ULPI_CLK_1  (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS8|PINCONF_PIN_8)
#define PINCONF_USB1_ULPI_CLK_2  (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSC|PINCONF_PIN_0)
#define PINCONF_USB1_ULPI_D0_1   (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS8|PINCONF_PIN_5)
#define PINCONF_USB1_ULPI_D0_2   (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSC|PINCONF_PIN_8)
#define PINCONF_USB1_ULPI_D0_3   (PINCONF_DIGITAL|PINCONF_FUNC5|PINCONF_PINSD|PINCONF_PIN_11)
#define PINCONF_USB1_ULPI_D1_1   (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS8|PINCONF_PIN_4)
#define PINCONF_USB1_ULPI_D1_2   (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSC|PINCONF_PIN_7)
#define PINCONF_USB1_ULPI_D2_1   (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS8|PINCONF_PIN_3)
#define PINCONF_USB1_ULPI_D2_2   (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSC|PINCONF_PIN_6)
#define PINCONF_USB1_ULPI_D3_1   (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSB|PINCONF_PIN_6)
#define PINCONF_USB1_ULPI_D3_2   (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSC|PINCONF_PIN_5)
#define PINCONF_USB1_ULPI_D4_1   (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSB|PINCONF_PIN_5)
#define PINCONF_USB1_ULPI_D4_2   (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSC|PINCONF_PIN_4)
#define PINCONF_USB1_ULPI_D5_1   (PINCONF_DIGITAL|PINCONF_FUNC0|PINCONF_PINSC|PINCONF_PIN_3)
#define PINCONF_USB1_ULPI_D5_2   (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSB|PINCONF_PIN_4)
#define PINCONF_USB1_ULPI_D6_1   (PINCONF_DIGITAL|PINCONF_FUNC0|PINCONF_PINSC|PINCONF_PIN_2)
#define PINCONF_USB1_ULPI_D6_2   (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSB|PINCONF_PIN_3)
#define PINCONF_USB1_ULPI_D7_1   (PINCONF_DIGITAL|PINCONF_FUNC0|PINCONF_PINSC|PINCONF_PIN_1)
#define PINCONF_USB1_ULPI_D7_2   (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSB|PINCONF_PIN_2)
#define PINCONF_USB1_ULPI_DIR_1  (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSB|PINCONF_PIN_1)
#define PINCONF_USB1_ULPI_DIR_2  (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSC|PINCONF_PIN_11)
#define PINCONF_USB1_ULPI_NXT_1  (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS8|PINCONF_PIN_6)
#define PINCONF_USB1_ULPI_NXT_2  (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSC|PINCONF_PIN_9)
#define PINCONF_USB1_ULPI_STP_1  (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINS8|PINCONF_PIN_7)
#define PINCONF_USB1_ULPI_STP_2  (PINCONF_DIGITAL|PINCONF_FUNC1|PINCONF_PINSC|PINCONF_PIN_10)
#define PINCONF_USB1_VBUS        (PINCONF_DIGITAL|PINCONF_FUNC2|PINCONF_PINS2|PINCONF_PIN_5)

#define CLKCONF_CGU_OUT0         (PINCONFIG_DIGITAL|PINCONF_FUNC5|PINCONF_CLK1)
#define CLKCONF_CGU_OUT1         (PINCONFIG_DIGITAL|PINCONF_FUNC5|PINCONF_CLK3)
#define CLKCONF_CLKOUT_1         (PINCONFIG_DIGITAL|PINCONF_FUNC1|PINCONF_CLK0)
#define CLKCONF_CLKOUT_2         (PINCONFIG_DIGITAL|PINCONF_FUNC1|PINCONF_CLK1)
#define CLKCONF_CLKOUT_3         (PINCONFIG_DIGITAL|PINCONF_FUNC1|PINCONF_CLK2)
#define CLKCONF_CLKOUT_4         (PINCONFIG_DIGITAL|PINCONF_FUNC1|PINCONF_CLK3)
#define CLKCONF_EMC_CLK0         (PINCONFIG_DIGITAL|PINCONF_FUNC0|PINCONF_CLK0)
#define CLKCONF_EMC_CLK01        (PINCONFIG_DIGITAL|PINCONF_FUNC5|PINCONF_CLK0)
#define CLKCONF_EMC_CLK1         (PINCONFIG_DIGITAL|PINCONF_FUNC0|PINCONF_CLK1)
#define CLKCONF_EMC_CLK2         (PINCONFIG_DIGITAL|PINCONF_FUNC0|PINCONF_CLK3)
#define CLKCONF_EMC_CLK23        (PINCONFIG_DIGITAL|PINCONF_FUNC5|PINCONF_CLK2)
#define CLKCONF_EMC_CLK3         (PINCONFIG_DIGITAL|PINCONF_FUNC0|PINCONF_CLK2)
#define CLKCONF_ENET_REF_CLK     (PINCONFIG_DIGITAL|PINCONF_FUNC7|PINCONF_CLK0)
#define CLKCONF_ENET_TX_CLK      (PINCONFIG_DIGITAL|PINCONF_FUNC7|PINCONF_CLK0)
#define CLKCONF_I2S0_TX_MCLK     (PINCONFIG_DIGITAL|PINCONF_FUNC6|PINCONF_CLK2)
#define CLKCONF_I2S1_RX_SCK_1    (PINCONFIG_DIGITAL|PINCONF_FUNC7|PINCONF_CLK2)
#define CLKCONF_I2S1_RX_SCK_2    (PINCONFIG_DIGITAL|PINCONF_FUNC7|PINCONF_CLK3)
#define CLKCONF_I2S1_TX_MCLK     (PINCONFIG_DIGITAL|PINCONF_FUNC7|PINCONF_CLK1)
#define CLKCONF_SD_CLK_1         (PINCONFIG_DIGITAL|PINCONF_FUNC4|PINCONF_CLK0)
#define CLKCONF_SD_CLK_2         (PINCONFIG_DIGITAL|PINCONF_FUNC4|PINCONF_CLK2)
#define CLKCONF_SSP1_SCK         (PINCONFIG_DIGITAL|PINCONF_FUNC6|PINCONF_CLK0)

/****************************************************************************************************
 * Public Types
 ****************************************************************************************************/

/****************************************************************************************************
 * Public Data
 ****************************************************************************************************/

/****************************************************************************************************
 * Public Functions
 ****************************************************************************************************/

#endif /* __ARCH_ARM_SRC_LPC43XX_CHIP_LPC4310203050_PINCONF_H */
